import re

black_list_words = [
    "ахуєнно", "ахуї", "ахуєнна", "ахуєть", "ахуєвші", "ахуєвший", "ахуєнний", "ахуєнчік", "ахуена",
    "ахуєл", "ахуел", "ахуенна", "ахуенно", "ахуеть", "ахуевший", "ахуенний", "ахуенчик", "ахуітельная ",
    "ахуїтєльно", "ахуітельно", "ахуїтельная", "ахуенность", "ахуєнність", "ахуееешь", "ахуєєш",
    "ахуєвай", "ахуївай", "ахуевай", "ахуй", "ахуеешь",
    
    "блядь", "бляді", "блядіна", "блядота", "блядки", "блядувати", "блять", "бля", "блєт", "блєть", "блет",
    "блеть",
    
    "виїбав", "виїбали", "відпиздити", "вийобуйся", "виїбнулась", "вахуї",
    "вийобуватись", "вийобується", "вїбали", "вїбу", "вїбав", "відсоси", "вїби", "виїбати", "виїбем",
    "виїбемо", "відсосали", "відсмокчи", "відсмоктали", "виєбу", "виблядки", "виблядок", "виїбнусь",
    "виїбнувся", "виєбнусь", "виєбнувся", "виебнусь", "виебнувся",
    
    "гандон", "гандони", "гандурас", "гандураси",
    
    "довбойоб", 'довбойоби', "довийобувався", "довийобуватись", "далбайоб", "долбойоб", "даун", "дауни",
    
    "ебучий", "ебучій", "ебальник", "ебло",
    
    "єбаний", "єбав", "єбана", "єбать", "єбанутий", "єбанат", "єбаш", "єбашити", "єбати", "єблан",
    "єбані", "єбало", "єбасос", "єбасосіна", "єбучий", "єбасосіну", "єбашив", "єбальник",
    "єбаной", "єбло", "єбанувася", "єблі", "єбля", "єбучій", "єблани", "єбланіща",
    
    "їбанат", "їбанати", "їбанутий", "їбашили", "їбашив", "їбать", "їбало", "їбанувся", "їбанулись",
    "їбаш", "їбати", "їбаний", "їбані", "їбасос", "їбасосіна", "їбучий", "їбасосіну",
    "їбальник", "їбануться", "їбав", "їбаной", "їблан", "їбланіща", "їбланіще",
    
    "ібав",
    
    "йобнувся", "йобнув", "йобнутий", "йобаний", "йобнули", "йобнуті", "йобана", "йобані", "йобнуться",
    "йобнутся",
    
    "заєбісь", "залупа", "зпиздити", "зпіздити", "заєбца", "заєбумба", "заїбали", "заєбали", "заїбав",
    "заєбав", "заїбала", "заєбала", "зайобувався", "заїбався", "заєбався", "заїбало", "заєбало",
    
    "курва", "курви",
    
    "найобсіки", "напиздів", "нахуя", "нахуй", "ніхуя", "невийобуйся", "невийобуйтесь", "наїбашу",
    "наїбашим", "наїбашив", "наїбашили", "ніхуясє", "ніхуясе", "нехуй", "нєхуй", "наїбав", "наєбав",
    "найобуй", "наєбал", "наебал", "неахуєвай", "неахуївай", "неахуевай", "наїбалово",
    "наєбалово",
    
    "ніга", "ніггер", "нігга",
    
    "охуїв", "охуївати", "охуєть", "охуїти", "охуїли", "охуївший", "охуївші", "охуївших", "охуєл",
    
    "пиздюнькай", "пизда", "пиздець", "пізда", "пиздак", "пиздаки", "підар", "підарас", "підараси",
    "підари", "підорас", "підарасіна", "пиздота", "піздюк", "піздюки", "пиздюнькаєш", "пиздюнькає",
    "пиздюнькають", "пиздякай", "пиздити", "пиздун", "піздун", "піздити", "пиздунця", "піздунця",
    "пиздунець", "піздунець", "пиздося", "піздося", "пиздуй", "піздуй", "пиздюк", "пітух",
    "педріла", "підріла", "педріли", "підріли", "піздец", "похуй", "піхуй", "пососав", "пососи",
    "пидорас", "піздос", "пиздос", "пездюк", "підарастичний", "підарастичні", "підарістичний",
    "піздаболи", "піздабол", "пиздаболи", "пиздабол", "підор", "підорок", "підори", "проїбав", "проєбав",
    "пиздячу", "піздячу", "пиздячить", "піздячить",
    
    "розїбав", "розїбали", "розїбашив", "розїбався", "розєбався", "розєбались", "розїбались", "розїбати",
    "розєбали", "розєбав", "розєбашив",
    
    "хуєсос", "хуєсоси", "хуй", "хуїла", "хуйло", "хуйня", "хуя", "хуїсос", "хуїсоси", "хуєпльот",
    "хуеплот", "хуясє", "хуясе", "хохол", "хохліна", "хуйню", "хуї", "хуїв", "хуйово", "хуйова",
    "хуйовий", "хую", "хуесос", "хуесоси",
    
    "сучара", "схуя", "схуялі", "спиздити", "спіздити", "спиздить", "спіздить", "соси",
    
    "ухуїти", "ухуївати", "ухуїли", "ухуїв", "ухуївший", "ухуївших", "урод", "уроди", "ухуєл",
    "уйобок",
    "уйобки", "уїбани", "уєбани", "уйобків", "уїбан", "уєбан",
    
    "шлюха", "шлюхи", "шалава", "шалави",
    
    "faggot",
    
    "kurwа",
    
    "cunt",
    
    "fuck", "fucking", "fucker",
    
    "motherfucker",
    
    "nіgеr", "nіggеr", "nіggа", "niga",
    
    "suck",
]

bad_games = ['warthunder', 'broken arrow', 'broken arow', 'вартандер', 'вартундер', 'брокен арроу', 'вартандера',
             'вартундера', 'брокен арроу', 'wt', 'ba', 'вар тандер', 'вар тундер', 'вар тандера', 'тундру']


blacklist_word_pattern = re.compile(r'\b(' + '|'.join(word for word in black_list_words) + r')\b')
blacklist_games_pattern = re.compile(r'\b(' + '|'.join(word for word in bad_games) + r')\b')
invitation_pattern = re.compile(r'https?://(www\.)?(discord\.gg|discord\.com/invite)/[a-zA-Z0-9]+')
